results/rest/stage-150/payload-small/200VUs/repeat-2/200vus-summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./src/rest/restTest.js
        output: json (./results/rest/stage-150/payload-small/200VUs/repeat-2/200vus.json)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 200 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 200/200 VUs, 463 complete and 0 interrupted iterations
default   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 1227 complete and 0 interrupted iterations
default   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 2022 complete and 0 interrupted iterations
default   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 2812 complete and 0 interrupted iterations
default   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 3622 complete and 0 interrupted iterations
default   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 4432 complete and 0 interrupted iterations
default   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 5256 complete and 0 interrupted iterations
default   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 6056 complete and 0 interrupted iterations
default   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m09.0s), 200/200 VUs, 6894 complete and 0 interrupted iterations
default   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m10.0s), 200/200 VUs, 7683 complete and 0 interrupted iterations
default   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m11.0s), 200/200 VUs, 8515 complete and 0 interrupted iterations
default   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m12.0s), 200/200 VUs, 9348 complete and 0 interrupted iterations
default   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m13.0s), 200/200 VUs, 10157 complete and 0 interrupted iterations
default   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m14.0s), 200/200 VUs, 10981 complete and 0 interrupted iterations
default   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m15.0s), 200/200 VUs, 11811 complete and 0 interrupted iterations
default   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m16.0s), 200/200 VUs, 12608 complete and 0 interrupted iterations
default   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m17.0s), 200/200 VUs, 13436 complete and 0 interrupted iterations
default   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m18.0s), 200/200 VUs, 14258 complete and 0 interrupted iterations
default   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m19.0s), 200/200 VUs, 15033 complete and 0 interrupted iterations
default   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m20.0s), 200/200 VUs, 15829 complete and 0 interrupted iterations
default   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m21.0s), 200/200 VUs, 16638 complete and 0 interrupted iterations
default   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m22.0s), 200/200 VUs, 17431 complete and 0 interrupted iterations
default   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m23.0s), 200/200 VUs, 18212 complete and 0 interrupted iterations
default   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m24.0s), 200/200 VUs, 19023 complete and 0 interrupted iterations
default   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m23.1s), 200/200 VUs, 19806 complete and 0 interrupted iterations
default   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m24.1s), 200/200 VUs, 20603 complete and 0 interrupted iterations
default   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m25.1s), 200/200 VUs, 21411 complete and 0 interrupted iterations
default   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m26.1s), 200/200 VUs, 22206 complete and 0 interrupted iterations
default   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m27.1s), 200/200 VUs, 22994 complete and 0 interrupted iterations
default   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m28.1s), 200/200 VUs, 23802 complete and 0 interrupted iterations
default   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m29.1s), 200/200 VUs, 24584 complete and 0 interrupted iterations
default   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m30.1s), 200/200 VUs, 25391 complete and 0 interrupted iterations
default   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m31.1s), 200/200 VUs, 26202 complete and 0 interrupted iterations
default   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m32.1s), 200/200 VUs, 27000 complete and 0 interrupted iterations
default   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m33.1s), 200/200 VUs, 27789 complete and 0 interrupted iterations
default   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m34.1s), 200/200 VUs, 28588 complete and 0 interrupted iterations
default   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m35.1s), 200/200 VUs, 29378 complete and 0 interrupted iterations
default   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m36.1s), 200/200 VUs, 30176 complete and 0 interrupted iterations
default   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m37.1s), 200/200 VUs, 30970 complete and 0 interrupted iterations
default   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m38.1s), 200/200 VUs, 31745 complete and 0 interrupted iterations
default   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m39.1s), 200/200 VUs, 32535 complete and 0 interrupted iterations
default   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m40.1s), 200/200 VUs, 33334 complete and 0 interrupted iterations
default   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m41.1s), 200/200 VUs, 34131 complete and 0 interrupted iterations
default   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m42.1s), 200/200 VUs, 34927 complete and 0 interrupted iterations
default   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m43.1s), 200/200 VUs, 35725 complete and 0 interrupted iterations
default   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m44.1s), 200/200 VUs, 36534 complete and 0 interrupted iterations
default   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m45.1s), 200/200 VUs, 37339 complete and 0 interrupted iterations
default   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m46.1s), 200/200 VUs, 38146 complete and 0 interrupted iterations
default   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m47.1s), 200/200 VUs, 38962 complete and 0 interrupted iterations
default   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m48.1s), 200/200 VUs, 39788 complete and 0 interrupted iterations
default   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m49.1s), 200/200 VUs, 40594 complete and 0 interrupted iterations
default   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m50.1s), 200/200 VUs, 41392 complete and 0 interrupted iterations
default   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m51.1s), 200/200 VUs, 42199 complete and 0 interrupted iterations
default   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m52.1s), 200/200 VUs, 43005 complete and 0 interrupted iterations
default   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m51.3s), 200/200 VUs, 43839 complete and 0 interrupted iterations
default   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m52.3s), 200/200 VUs, 44647 complete and 0 interrupted iterations
default   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m53.3s), 200/200 VUs, 45486 complete and 0 interrupted iterations
default   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m54.3s), 200/200 VUs, 46307 complete and 0 interrupted iterations
default   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m55.3s), 200/200 VUs, 47117 complete and 0 interrupted iterations
default   [  98% ] 200 VUs  0m59.0s/1m0s

running (0m56.3s), 200/200 VUs, 47937 complete and 0 interrupted iterations
default   [ 100% ] 200 VUs  1m00.0s/1m0s


  █ TOTAL RESULTS 

    CUSTOM
    benchmark_slow_failure_rate....: 0.03%  17 out of 48150
    benchmark_total_failure_rate...: 0.03%  17 out of 48150

    HTTP
    http_req_duration..............: avg=245.49ms min=17.68µs  med=247.11ms max=1.24s p(90)=260.41ms p(95)=265.74ms
      { expected_response:true }...: avg=245.49ms min=17.68µs  med=247.11ms max=1.24s p(90)=260.41ms p(95)=265.74ms
    http_req_failed................: 0.00%  0 out of 48150
    http_reqs......................: 48150  851.087868/s

    EXECUTION
    iteration_duration.............: avg=249.61ms min=211.22ms med=247.3ms  max=1.24s p(90)=260.54ms p(95)=265.84ms
    iterations.....................: 48150  851.087868/s
    vus............................: 200    min=200         max=200
    vus_max........................: 200    min=200         max=200

    NETWORK
    data_received..................: 12 MB  212 kB/s
    data_sent......................: 7.5 MB 133 kB/s



running (0m56.6s), 000/200 VUs, 48150 complete and 0 interrupted iterations
default ✓ [ 100% ] 200 VUs  1m0s